## Terraform Plan Output - Uat

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

# aws_rds_cluster.rds_cluster has been changed
~ resource "aws_rds_cluster" "rds_cluster" {
      + enabled_cloudwatch_logs_exports     = []
        id                                  = "shipment-tracker"
      + tags                                = {}
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
# aws_security_group.security_group has been changed
~ resource "aws_security_group" "security_group" {
        id                     = "sg-01f89a318da07a9d2"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.51.0.0/16",
                ]
              + description      = "Allow traffic from VPC"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from legacy VPC"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "755865716437/sg-6b57e40f",
                ]
              + self             = false
              + to_port          = 5432
            },
        ]
        name                   = "uat-shipment-tracker-db-sg"
      + tags                   = {}
        # (7 unchanged attributes hidden)
    }
# aws_db_subnet_group.subnet_group has been changed
~ resource "aws_db_subnet_group" "subnet_group" {
        id          = "uat-shipment-tracker"
        name        = "uat-shipment-tracker"
      + tags        = {}
        # (4 unchanged attributes hidden)
    }
# aws_kms_key.key has been changed
~ resource "aws_kms_key" "key" {
        id                                 = "65d6d147-e1e7-4465-8839-53c5a529764d"
      + tags                               = {}
        # (11 unchanged attributes hidden)
    }
# aws_security_group_rule.legacy_vpc has been changed
~ resource "aws_security_group_rule" "legacy_vpc" {
      + cidr_blocks              = []
        id                       = "sgrule-2487716616"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (8 unchanged attributes hidden)
    }
# aws_security_group_rule.vpc has been changed
~ resource "aws_security_group_rule" "vpc" {
        id                = "sgrule-2225686304"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (8 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# aws_iam_instance_profile.ec2_ssm_iam will be created
+ resource "aws_iam_instance_profile" "ec2_ssm_iam" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2-ssm"
      + path        = "/"
      + role        = "ec2-ssm-role"
      + tags_all    = {
          + "Created_by"  = "platform-engineering@fundingcircle.com"
          + "Domain"      = "platform"
          + "Environment" = "uat"
          + "Managed_by"  = "terraform"
          + "Repository"  = "github.com/FundingCircle/shipment_tracker"
          + "Team"        = "platform-engineering"
        }
      + unique_id   = (known after apply)
    }

# aws_iam_role.ec2_ssm_iam will be created
+ resource "aws_iam_role" "ec2_ssm_iam" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2-ssm-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Created_by"  = "platform-engineering@fundingcircle.com"
          + "Domain"      = "platform"
          + "Environment" = "uat"
          + "Managed_by"  = "terraform"
          + "Repository"  = "github.com/FundingCircle/shipment_tracker"
          + "Team"        = "platform-engineering"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

# aws_iam_role_policy.ec2_ssm_iam will be created
+ resource "aws_iam_role_policy" "ec2_ssm_iam" {
      + id     = (known after apply)
      + name   = "ec2-ssm-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                          + "ssm:UpdateInstanceInformation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ssm"
                    },
                  + {
                      + Action   = "s3:GetEncryptionConfiguration"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "s3"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

# aws_instance.dump_restore will be created
+ resource "aws_instance" "dump_restore" {
      + ami                                  = "ami-05cd35b907b4ffe77"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "ec2-ssm"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "c5.2xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0313d3a0f9ff8749e"
      + tags                                 = {
          + "Name" = "pg_dump pg_restore"
        }
      + tags_all                             = {
          + "Created_by"  = "platform-engineering@fundingcircle.com"
          + "Domain"      = "platform"
          + "Environment" = "uat"
          + "Managed_by"  = "terraform"
          + "Name"        = "pg_dump pg_restore"
          + "Repository"  = "github.com/FundingCircle/shipment_tracker"
          + "Team"        = "platform-engineering"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = "arn:aws:kms:eu-west-1:058180101585:key/65d6d147-e1e7-4465-8839-53c5a529764d"
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 250
          + volume_type           = (known after apply)
        }
    }

# aws_security_group.ssm will be created
+ resource "aws_security_group" "ssm" {
      + arn                    = (known after apply)
      + description            = "For temporary VPC endpoints for SSM"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.51.0.0/16",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.51.0.0/16",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Created_by"  = "platform-engineering@fundingcircle.com"
          + "Domain"      = "platform"
          + "Environment" = "uat"
          + "Managed_by"  = "terraform"
          + "Repository"  = "github.com/FundingCircle/shipment_tracker"
          + "Team"        = "platform-engineering"
        }
      + vpc_id                 = "vpc-00917e94139ab5d61"
    }

# aws_vpc_endpoint.ec2messages will be created
+ resource "aws_vpc_endpoint" "ec2messages" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ec2messages"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0313d3a0f9ff8749e",
        ]
      + tags_all              = {
          + "Created_by"  = "platform-engineering@fundingcircle.com"
          + "Domain"      = "platform"
          + "Environment" = "uat"
          + "Managed_by"  = "terraform"
          + "Repository"  = "github.com/FundingCircle/shipment_tracker"
          + "Team"        = "platform-engineering"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-00917e94139ab5d61"
    }

# aws_vpc_endpoint.ssm will be created
+ resource "aws_vpc_endpoint" "ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ssm"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0313d3a0f9ff8749e",
        ]
      + tags_all              = {
          + "Created_by"  = "platform-engineering@fundingcircle.com"
          + "Domain"      = "platform"
          + "Environment" = "uat"
          + "Managed_by"  = "terraform"
          + "Repository"  = "github.com/FundingCircle/shipment_tracker"
          + "Team"        = "platform-engineering"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-00917e94139ab5d61"
    }

# aws_vpc_endpoint.ssmmessages will be created
+ resource "aws_vpc_endpoint" "ssmmessages" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ssmmessages"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0313d3a0f9ff8749e",
        ]
      + tags_all              = {
          + "Created_by"  = "platform-engineering@fundingcircle.com"
          + "Domain"      = "platform"
          + "Environment" = "uat"
          + "Managed_by"  = "terraform"
          + "Repository"  = "github.com/FundingCircle/shipment_tracker"
          + "Team"        = "platform-engineering"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-00917e94139ab5d61"
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

<!-- id: d0fef86a82cf633c4773fa2bac5cd7211e274bec5213402434fd87526055c53f -->
